#### ProjectPosition Members

---

|  |
| --- |
| ProjectPosition Class   Constructors   Methods   Properties   See Also |

The  ProjectPosition  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ProjectPosition(ProjectPosition) | Creates a copy of the ProjectPosition. |
| Public method | ProjectPosition(Double, Double, Double, Double) | Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ProjectPosition |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Angle | Angle from True North. |
| Public property | EastWest | East/West offset. |
| Public property | Elevation | Elevation above ground level. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NorthSouth | North/South offset |

# See Also

ProjectPosition Class

Autodesk.Revit.DB Namespace